PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_i3c.h
#define I3C_CORE_DEV_CHAR_TABLE5_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE5_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE5_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE5_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE5_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE5_LOC4_DEV_DYNAMIC_ADDR5_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE5_LOC4_DEV_DYNAMIC_ADDR5_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE6_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE6_LOC4_DEV_DYNAMIC_ADDR6_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE6_LOC4_DEV_DYNAMIC_ADDR6_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE7_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE7_LOC4_DEV_DYNAMIC_ADDR7_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE7_LOC4_DEV_DYNAMIC_ADDR7_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE8_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE8_LOC4_DEV_DYNAMIC_ADDR8_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE8_LOC4_DEV_DYNAMIC_ADDR8_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_DCR_Pos   0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_DCR_Msk   0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_BCR_Pos   8UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC3_BCR_Msk   0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE9_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE9_LOC4_DEV_DYNAMIC_ADDR9_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE9_LOC4_DEV_DYNAMIC_ADDR9_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_DCR_Pos  0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_DCR_Msk  0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_BCR_Pos  8UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC3_BCR_Msk  0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE10_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE10_LOC4_DEV_DYNAMIC_ADDR10_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE10_LOC4_DEV_DYNAMIC_ADDR10_Msk 0xFFUL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC1 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC1_MSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC1_MSB_PROVISIONAL_ID_Msk 0xFFFFFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC2 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC2_LSB_PROVISIONAL_ID_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC2_LSB_PROVISIONAL_ID_Msk 0xFFFFUL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC3 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_DCR_Pos  0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_DCR_Msk  0xFFUL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_BCR_Pos  8UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC3_BCR_Msk  0xFF00UL
/* I3C_CORE.DEV_CHAR_TABLE11_LOC4 */
#define I3C_CORE_DEV_CHAR_TABLE11_LOC4_DEV_DYNAMIC_ADDR11_Pos 0UL
#define I3C_CORE_DEV_CHAR_TABLE11_LOC4_DEV_DYNAMIC_ADDR11_Msk 0xFFUL
/* I3C_CORE.DEV_ADDR_TABLE_LOC1 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC1_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC2 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC2_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC3 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC3_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC4 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC4_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC5 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC5_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC6 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC6_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC7 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC7_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC8 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC8_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC9 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC9_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC10 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC10_LEGACY_I2C_DEVICE_Msk 0x80000000UL
/* I3C_CORE.DEV_ADDR_TABLE_LOC11 */
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_STATIC_ADDR_Pos 0UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_STATIC_ADDR_Msk 0x7FUL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_DYNAMIC_ADDR_Pos 16UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_DYNAMIC_ADDR_Msk 0xFF0000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_NACK_RETRY_CNT_Pos 29UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_DEV_NACK_RETRY_CNT_Msk 0x60000000UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_LEGACY_I2C_DEVICE_Pos 31UL
#define I3C_CORE_DEV_ADDR_TABLE_LOC11_LEGACY_I2C_DEVICE_Msk 0x80000000UL


/* I3C.CTRL */
#define I3C_CTRL_ENABLED_Pos                    31UL
#define I3C_CTRL_ENABLED_Msk                    0x80000000UL
/* I3C.TGT_STATUS */
#define I3C_TGT_STATUS_WAKEUP_Pos               0UL
#define I3C_TGT_STATUS_WAKEUP_Msk               0x1UL
#define I3C_TGT_STATUS_I2C_GLITCH_FILTER_EN_Pos 8UL
#define I3C_TGT_STATUS_I2C_GLITCH_FILTER_EN_Msk 0x100UL
/* I3C.CCC_GETSTATUS */
#define I3C_CCC_GETSTATUS_PENDING_INT_Pos       16UL
#define I3C_CCC_GETSTATUS_PENDING_INT_Msk       0xF0000UL
#define I3C_CCC_GETSTATUS_ACT_MODE_Pos          24UL
#define I3C_CCC_GETSTATUS_ACT_MODE_Msk          0x3000000UL


#endif /* _CYIP_I3C_H_ */


/* [] END OF FILE */
